Examinator/src/Enums/ВариантыЗагрузкиКартинокФайловСУЗ/ВариантыЗагрузкиКартинокФайловСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыЗагрузкиКартинокФайловСУЗ</name>
  <enumValues>
    <name>Стандартные</name>
  </enumValues>
  <enumValues>
    <name>Исходные</name>
  </enumValues>
  <enumValues>
    <name>УвеличиватьСтандартные</name>
  </enumValues>
  <enumValues>
    <name>УвеличиватьИсходные</name>
  </enumValues>
  <enumValues>
    <name>РасширятьСтандартные</name>
  </enumValues>
  <enumValues>
    <name>РасширятьИсходные</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/ПодборкиСУЗ/ПодборкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодборкиСУЗ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ЭтоТест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПрезентация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбиратьЭлементыИзРубрикатора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяТеста</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассификационнаяГруппировка</name>
    <type>
      <types>CatalogRef.КлассификационныеГруппировкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьГруппыЭлементов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереходитьВпередАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьКлассификатор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьНавигацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСтартовуюСтраницу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеЭлементов</name>
    <type>
      <types>EnumRef.ВариантыПредставленияЭлементовПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СвернутьРазделы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНавигации</name>
    <type>
      <types>EnumRef.ТипыНавигацииПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоГруппЭлементов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартовыйРесурс</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыравниваниеСтартовогоРесурса</name>
    <type>
      <types>EnumRef.СпособыВыравниванияСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеТестирования</name>
    <type>
      <types>EnumRef.НазначенияТестированийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСложностиПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСложностиПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТаймер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматТаймера</name>
    <type>
      <types>EnumRef.ФорматыТаймераСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийФинальныйКомментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийФинальныйРесурс</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НумероватьСтраницы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПредыдущиеПопытки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьОткрытыеВопросы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСтоимостьВопроса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьКомментарииВопросов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформацияНаФинальнойСтранице</name>
    <type>
      <types>EnumRef.ИнформацияНаФинальнойСтраницеТестаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Презентация</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.РесурсыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/СводыЗнанийСУЗ/СводыЗнанийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СводыЗнанийСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>РуководствоПользователя</name>
      <description>Руководство пользователя</description>
    </items>
  </predefined>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартоваяСтраница</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьПоставщика</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыЭлектронныхРесурсовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательнаяНавигация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьСодержание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Глоссарий</name>
    <type>
      <types>CatalogRef.ГлоссарииСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочнаяИнформация</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Базовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПервуюСсылкуНаТермин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТерминВсплывающейПодсказкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьНепройденное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПользовательскиеНастройки</name>
    <attributes>
      <name>ВидНастройки</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыНастроекЭлектронныхРесурсовСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыгружатьПриОткрытии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.ТерминыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/CommonModules/РазработкаСУЗКлиент/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ВЕРСИИ ОБЪЕКТОВ

Процедура СоздатьВерсиюОбъекта(Форма, СтруктураНовойВерсии) Экспорт
	
	ПараметрыСозданияВерсии = Новый Структура("Форма, СтруктураНовойВерсии", Форма, СтруктураНовойВерсии);
	
	Если Форма.Модифицированность Тогда
		
		СоздатьВерсиюОбъектаПродолжение = Новый ОписаниеОповещения("СоздатьВерсиюОбъектаПродолжение", ЭтотОбъект, ПараметрыСозданияВерсии);		
			
		ПоказатьВопрос(СоздатьВерсиюОбъектаПродолжение, НСтр("ru = 'Записать текущую версию?'"), РежимДиалогаВопрос.ДаНетОтмена, 0);
		
	Иначе
		
		СоздатьВерсиюОбъектаПродолжение(Неопределено, ПараметрыСозданияВерсии);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьВерсиюОбъектаПродолжение(Ответ, ПараметрыСозданияВерсии) Экспорт
	
	Форма = ПараметрыСозданияВерсии.Форма;
	СтруктураНовойВерсии = ПараметрыСозданияВерсии.СтруктураНовойВерсии;
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
	    Форма.Записать();
	КонецЕсли;
		
	Форма.Элементы.Поставщик.ТолькоПросмотр  = Ложь;
	Форма.Элементы.Версия.ТолькоПросмотр     = Ложь;
	Форма.Элементы.СоздатьВерсию.Доступность = Ложь;
	
	Форма.Объект.Версия    = СтруктураНовойВерсии.Версия;
	Форма.Объект.Поставщик = СтруктураНовойВерсии.Поставщик;
	
	// Форма.Модифицированность = Истина; <Наблюдается ошибка, после загузки другой версии.>		
	
КонецПроцедуры	

Процедура ОткрытьВерсииОбъекта(Форма, Объект) Экспорт
	
	ПараметрыФормы = Новый Структура("СсылкаНаОбъект", Объект.Ссылка);
	ФормаВерсий = ОткрытьФорму("ОбщаяФорма.ВерсииОбъектаСУЗ", ПараметрыФормы, Форма);
	
КонецПроцедуры

Процедура УстановитьДоступностьЭлементовВерсииДанных(Форма) Экспорт
	
	Если Форма.Объект.Ссылка.Пустая() Тогда
		Форма.Элементы.Поставщик.ТолькоПросмотр  = Ложь;
		Форма.Элементы.Версия.ТолькоПросмотр     = Ложь;
		Форма.Элементы.СоздатьВерсию.Доступность = Ложь;
	Иначе
		Форма.Элементы.Поставщик.ТолькоПросмотр  = Истина;
		Форма.Элементы.Версия.ТолькоПросмотр     = Истина;
		Форма.Элементы.СоздатьВерсию.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// РЕДАКТОР

Процедура ВставитьСсылкуВФорматированныйДокумент(Форма, ЭлементФормыФорматированногоДокумента, ФорматированныйДокумент) Экспорт
	
	// Делаем общие проверки
	
	Отказ = Ложь;
	
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(Форма, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	// Ищем выделенную гиперссылку
	
	ЗакладкаНачала = 0;
	ЗакладкаОкончания = 0;
	
	ЭлементФормыФорматированногоДокумента.ПолучитьГраницыВыделения(ЗакладкаНачала, ЗакладкаОкончания);
	
	МассивВыделенныхЭлементов = ФорматированныйДокумент.ПолучитьЭлементы(ЗакладкаНачала, ЗакладкаОкончания);
	
	ВыделенныйЭлемент = Неопределено;
	ВыделенныйТекст = ЭлементФормыФорматированногоДокумента.ВыделенныйТекст;
	
	Если ЗначениеЗаполнено(ВыделенныйТекст) И ТипЗнч(МассивВыделенныхЭлементов) = Тип("Массив") И МассивВыделенныхЭлементов.Количество() > 0 Тогда
		
		Если МассивВыделенныхЭлементов.Количество() > 1 Тогда
			ПоказатьПредупреждение(,НСтр("ru = 'В документе выделено более одного элемента'"));
			Возврат;			
		КонецЕсли;		
		
		ВыделенныйЭлемент = МассивВыделенныхЭлементов[0];
		
	Иначе
		
		ПоказатьПредупреждение(,НСтр("ru = 'Требуется выделить текст, для которого необходимо установить ссылку'"));
		Возврат;				
		
	КонецЕсли;
	
	// Открываем форму выбора элемента
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыделенныйЭлемент", ВыделенныйЭлемент);
	ДополнительныеПараметры.Вставить("ЭлементФормыФорматированногоДокумента", ЭлементФормыФорматированногоДокумента);
	ДополнительныеПараметры.Вставить("ФорматированныйДокумент", ФорматированныйДокумент);
	ДополнительныеПараметры.Вставить("ВыделенныйТекст", ВыделенныйТекст);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВставитьСсылкуПродолжение", ЭтотОбъект, ДополнительныеПараметры);		
	
	АдресВыделеннойСсылки = ВыделенныйЭлемент.НавигационнаяСсылка;
	
	ОбщегоНазначенияСУКлиентСервер.ИсправитьПроблемнуюСсылкуФорматированногоДокумента(АдресВыделеннойСсылки);	
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Гиперссылка", АдресВыделеннойСсылки);
	ПараметрыФормы.Вставить("ЭлектронныйРесурс", Форма.ЭлектронныйРесурс);
	ПараметрыФормы.Вставить("ОбъектВладелец", Форма.Объект.Ссылка);
	
	ОткрытьФорму("ОбщаяФорма.ГиперссылкаНаОбъектСУЗ", ПараметрыФормы, Форма,,,,ОписаниеОповещения);
	
КонецПроцедуры

Процедура ВставитьСсылкуПродолжение(ЗначениеВыбора, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ЗначениеВыбора) Тогда
		
		АдресСсылки = "";
		ТекстСсылки = "";
		
		Если ТипЗнч(ЗначениеВыбора) = Тип("СправочникСсылка.СодержаниеСУЗ") Тогда
			
			АдресСсылки = "e1c:///" + ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(ЗначениеВыбора);
			ТекстСсылки = "<a href="""+АдресСсылки+""">" + ДополнительныеПараметры.ВыделенныйТекст + "</a>";			
			
		КонецЕсли;	
		
		Если ТипЗнч(ЗначениеВыбора) = Тип("СправочникСсылка.РесурсыОбъектовСУЗ") Тогда
			
			АдресСсылки = "e1c:///" + ОбъектыСУЗПовтИсп.СсылкаНаПодсказку(ЗначениеВыбора);
			ТекстСсылки = "<a href="""+АдресСсылки+""" isTip=""true"" id=""tip_"+СтрЗаменить(Строка(ЗначениеВыбора.УникальныйИдентификатор()), "-", "")+""">" + ДополнительныеПараметры.ВыделенныйТекст + "</a>";
			
		КонецЕсли;		
		
		Если ТипЗнч(ЗначениеВыбора) = Тип("Строка") Тогда
			
			Если Лев(ЗначениеВыбора, 1) = "?" Тогда
				АдресСсылки = "e1c:///" + ЗначениеВыбора;			
			Иначе
				АдресСсылки = ЗначениеВыбора;
			КонецЕсли;			
			
			ТекстСсылки = "<a href="""+АдресСсылки+""">" + ДополнительныеПараметры.ВыделенныйТекст + "</a>";
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(АдресСсылки) И ЗначениеЗаполнено(ТекстСсылки) Тогда
		
			Если ЗначениеЗаполнено(ДополнительныеПараметры.ВыделенныйЭлемент.НавигационнаяСсылка) Тогда
				ДополнительныеПараметры.ВыделенныйЭлемент.НавигационнаяСсылка = АдресСсылки;
				// Примечание: если будет ссылка на подсказку, то атрибуты тега A ссылки не проверяются, т.е. 
				// Всплывающая подсказка работать не будет. 
			Иначе
				ДополнительныеПараметры.ЭлементФормыФорматированногоДокумента.ВыделенныйТекст = ТекстСсылки;
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры	

Процедура ИмяРедактируемыхДанныхПриИзменении(Форма) Экспорт
	
	Если Форма.ИмяРедактируемыхДанных = Форма.ИмяЗагруженныхДанных Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРедактора = ?(Форма.Объект.ИспользуетсяФорматированныйДокумент, "ФорматированныйДокумент", "ТекстовыйДокумент");
	
	// Сохраняем загруженные в редактор данные
	
	Форма[Форма.ИмяЗагруженныхДанных] = Форма[ИмяРедактора];
	
	// Загружаем новые данные в редактор
	
	Форма[ИмяРедактора] = Форма[Форма.ИмяРедактируемыхДанных];
	
	Форма.ИмяЗагруженныхДанных = Форма.ИмяРедактируемыхДанных;
	
	// Управляем видимостью кнопок
	
	РазработкаСУЗКлиентСервер.УстановитьЗаголовокДоступныхДанныхВизуальногоРедактора(Форма);
	
КонецПроцедуры

Процедура ИмяРедактируемыхДанныхПриЗаписи(Форма) Экспорт
	
	Если Форма.Объект.ИспользуетсяФорматированныйДокумент Тогда
		
		Форма[Форма.ИмяРедактируемыхДанных] = Форма.ФорматированныйДокумент;
		
	Иначе
		
		Форма[Форма.ИмяРедактируемыхДанных] = Форма.ТекстовыйДокумент;
		
	КонецЕсли;
	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕТАСКИВАНИЕ ЭЛЕМЕНТОВ (в настоящее время только файлов)

Процедура ОбработатьСобытиеПроверкаПеретаскивания(ПараметрыПеретаскивания, ОписаниеДопустимыхТипов=Неопределено, СтандартнаяОбработка) Экспорт
	
	Значение    = ПараметрыПеретаскивания.Значение;
	ТипЗначения = ТипЗнч(ПараметрыПеретаскивания.Значение);
	
	// 1. Проверяем возможность перетаскивания, когда нет описания типов
	
	Если ОписаниеДопустимыхТипов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// 2. Проверяем возможность перетаскивания с описанием допустимых типов
	
	Если ТипЗначения = Тип("Массив") Тогда
		ТипЗначения = ТипЗнч(ПараметрыПеретаскивания.Значение[0]);
	КонецЕсли;
	
	Если ОписаниеДопустимыхТипов.СодержитТип(ТипЗначения) Тогда
		
		СтандартнаяОбработка = Ложь;
		ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.Копирование;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьСобытиеПеретаскивание(Знач ПараметрыПеретаскивания, ОписаниеДопустимыхТипов, СтандартнаяОбработка, Знач Родитель, Знач ВладелецДанных, ТаблицаДанных, Форма) Экспорт
	
	Отказ = Ложь;
	
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(Форма, Отказ);
		
	Если Отказ Тогда
		
		СтандартнаяОбработка = Ложь;
		Возврат;
		
	КонецЕсли;	
	
	Если ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ТипЗначения = ТипЗнч(ПараметрыПеретаскивания.Значение);
	Значение    = ПараметрыПеретаскивания.Значение;
	
	// Приводим значение к типу "Массив".
	
	Если ТипЗначения <> Тип("Массив") Тогда
		
		МассивЗначений = Новый Массив();
		МассивЗначений.Добавить(ПараметрыПеретаскивания.Значение);
		
		Значение    = МассивЗначений;
		ТипЗначения = Тип("Массив");
		
	КонецЕсли;
	
	// Примечание: предполагается, что массив содержит элементы одного типа.
	
	Если ОписаниеДопустимыхТипов.СодержитТип(ТипЗнч(Значение[0])) Тогда
		
		Если ТипЗнч(Значение[0]) = Тип("Файл") Тогда // Перетаскиваем файл
			
			СтандартнаяОбработка = Ложь;
			
			#Если ВебКлиент Тогда
		
			ПоказатьПредупреждение(,НСТр("ru = 'Загрузка файлов в веб-клиенте не поддерживается'"));
				
			Возврат;
				
			#Иначе
				
			ЭлектронныйРесурс = Неопределено;
			Подборка          = Неопределено;
			Ресурс            = Неопределено;
			Глоссарий         = неопределено;
			
			Если ТипЗнч(ВладелецДанных) = Тип("СправочникСсылка.РесурсыСУЗ") Тогда
				Ресурс = ВладелецДанных;
			КонецЕсли;
	
			Если ТипЗнч(ВладелецДанных) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
				ЭлектронныйРесурс = ВладелецДанных;
			КонецЕсли;
			
			Если ТипЗнч(ВладелецДанных) = Тип("СправочникСсылка.ГлоссарииСУЗ") Тогда
				Глоссарий = ВладелецДанных;
			КонецЕсли;
			
			Если ТипЗнч(ВладелецДанных) = Тип("СправочникСсылка.ПодборкиСУЗ") Тогда
				ЭлектронныйРесурс = Форма.ЭлектронныйРесурс;
				Подборка = ВладелецДанных;
			КонецЕсли;
			
			ФайлыДляЗагрузки = Новый Массив;
			
			Для каждого Файл Из Значение Цикл
			
				ФайлыДляЗагрузки.Добавить(Файл.ПолноеИмя);	
			
			КонецЦикла;
			
			ЗагрузитьФайлы(ЭлектронныйРесурс, Подборка, Ресурс, Глоссарий, Родитель,, ФайлыДляЗагрузки);
			
			ТаблицаДанных.Обновить();
			
			#КонецЕсли
		
		КонецЕсли;
		
		Если ТипЗнч(Значение[0]) = Тип("СправочникСсылка.СодержаниеСУЗ")
			И ТипЗнч(ВладелецДанных) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
			
			ВладелецЭлементаСодержания = ОбщегоНазначенияСУВызовСервера.ЗначениеРеквизитаОбъекта(Значение[0], "Владелец");
			
			Если ВладелецЭлементаСодержания <> ВладелецДанных Тогда
				
				СтандартнаяОбработка = Ложь;
				
				РазработкаСУЗ.СкопироватьЭлементыСодержания(ВладелецДанных, Значение, Родитель);
				
				ТаблицаДанных.Обновить();
				
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПОРЯДОК ЭЛЕМЕНТОВ

// Перемещает элемент вверх или вниз в таблице
//
Процедура ПереместитьЭлемент(Направление, Таблица) Экспорт
	
	Если Таблица.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаНаЭлемент = Таблица.ТекущиеДанные.Ссылка;
	
	РазработкаСУЗ.ПереместитьЭлемент(Направление, СсылкаНаЭлемент);
	
	Таблица.Обновить();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// РАБОТА С РЕСУРСАМИ, ФАЙЛАМИ И ДОКУМЕНТАМИ

// Файлы

Процедура ЗагрузитьФайлы(ЭлектронныйРесурс = Неопределено, Подборка = Неопределено, Ресурс = Неопределено, Глоссарий = Неопределено, Родитель = Неопределено, ТипКонтента = Неопределено, ФайлыДляЗагрузки = Неопределено, ОписаниеОповещения = Неопределено, СкрыватьЭлементы = Ложь) Экспорт
	
	#Если ВебКлиент Тогда
		
	ПоказатьПредупреждение(,НСТр("ru = 'Загрузка файлов в веб-клиенте не поддерживается'"));
		
	Возврат;
		
	#Иначе
		
	// Принято решение сначала открывать форму, а затем выбирать файл,
	// так как в противном случае недоступны уроки.
	
	Если ФайлыДляЗагрузки = Неопределено И ЗначениеЗаполнено(ТипКонтента) Тогда
		ФайлыДляЗагрузки = Новый Массив;
		ФайлыДляЗагрузки.Добавить(Неопределено);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТипКонтента) Тогда
			
		ОткрытьФорму("Справочник.РесурсыСУЗ.Форма.ФормаИмпортаФайлов", Новый Структура("ФайлыДляЗагрузки, ЭлектронныйРесурс, Подборка, Ресурс, Родитель, СкрыватьЭлементы", ФайлыДляЗагрузки, ЭлектронныйРесурс, Подборка, Ресурс, Родитель, СкрыватьЭлементы),,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли НРег(ТипКонтента) = "глоссарий" Тогда
		
		Для каждого ФайлДляЗагрузки Из ФайлыДляЗагрузки Цикл
			ОткрытьФорму("Справочник.ГлоссарииСУЗ.Форма.ФормаИмпортаГлоссария", Новый Структура("ФайлДляЗагрузки, ЭлектронныйРесурс, ЭлементСодержания, ГлоссарийДляОбновления", ФайлДляЗагрузки, ЭлектронныйРесурс, Родитель, Глоссарий),,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЦикла;		
			
	ИначеЕсли НРег(ТипКонтента) = "тест" Тогда
		
		Для каждого ФайлДляЗагрузки Из ФайлыДляЗагрузки Цикл
			ОткрытьФорму("Справочник.ПодборкиСУЗ.Форма.ФормаСозданияИзФайлов", Новый Структура("ФайлДляЗагрузки, ЭлектронныйРесурс, ЭлементСодержания, ПодборкаДляОбновления", ФайлДляЗагрузки, ЭлектронныйРесурс, Родитель, Подборка),,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЦикла;
		
	Иначе
		
		ВызватьИсключение НСтр("ru = 'Неизвестный тип загрузки'");
		
	КонецЕсли;
		
	#КонецЕсли
 	
КонецПроцедуры

// Ресурсы

Процедура ОбработкаСозданияРесурса(Форма, Элемент, СтандартнаяОбработка, Подборка = Неопределено, ЭлектронныйРесурс=Неопределено) Экспорт
		
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Справочник.РесурсыСУЗ.ФормаОбъекта", Новый Структура("ОткрытьФормуФайла, РежимВыбора, Подборка, ЭлектронныйРесурс", Истина, Истина, Подборка, ЭлектронныйРесурс), Элемент);
	
КонецПроцедуры

Процедура ОбработкаВыбораРесурса(ВыбранноеЗначение) Экспорт 
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ФайлыСУЗ") Тогда
		ВыбранноеЗначение = ОбщегоНазначенияСУВызовСервера.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "Владелец");
	КонецЕсли;

КонецПроцедуры	

Процедура ОбработкаОткрытияРесурса(Элемент, СтандартнаяОбработка, Знач Ресурс) Экспорт
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Ресурс) Тогда
		ОткрытьФорму("Справочник.РесурсыСУЗ.ФормаОбъекта", Новый Структура("ОткрытьФормуФайла, Ключ", Истина, Ресурс), Элемент);	
	КонецЕсли;
КонецПроцедуры

// Документы и презентации

Функция ЕстьПоддержкаДокументов() Экспорт
	
	Если ПараметрыПриложения = Неопределено Тогда
		ПараметрыПриложения = Новый Соответствие; // Глобальная переменная
	КонецЕсли;	

	ИмяПараметра = "ЭлектронныеРесурсы.ЕстьПоддержкаДокументов";
	
	Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
	
		ЕстьПоддержка = Ложь;
		
		#Если НЕ ВебКлиент Тогда
			
		СистемнаяИнформация = Новый СистемнаяИнформация();
				
		ТипПлатформыНаКлиенте = СистемнаяИнформация.ТипПлатформы;

		Если ТипПлатформыНаКлиенте = ТипПлатформы.Windows_x86 ИЛИ ТипПлатформыНаКлиенте = ТипПлатформы.Windows_x86_64 Тогда		
			
			ЕстьПоддержка = Истина;
			
		КонецЕсли;	
			
		#КонецЕсли	
			
		ПараметрыПриложения.Вставить(ИмяПараметра, ЕстьПоддержка);
		
	Иначе
		
		ЕстьПоддержка = ПараметрыПриложения[ИмяПараметра];	
		
	КонецЕсли;
	
	Возврат ЕстьПоддержка;
	
КонецФункции

Процедура СформироватьДокументДляСохраненияВБазе(ПараметрыЗагрузки = Неопределено) Экспорт
	
	#Если НЕ ВебКлиент Тогда
		
	// Делаем проверки
	//
	
	Если ПараметрыЗагрузки = Неопределено
		ИЛИ	НЕ ПараметрыЗагрузки.Свойство("Приложение")
		ИЛИ НЕ ПараметрыЗагрузки.Свойство("УникальныйИдентификатор")
		ИЛИ НЕ ПараметрыЗагрузки.Свойство("ПутьКДокументу") Тогда
		
		ВызватьИсключение НСтр("ru = 'Отсутствуют обязательные параметры загрузки документа'")
		
	КонецЕсли;
		
	ФайлДокумента = Новый Файл(ПараметрыЗагрузки.ПутьКДокументу);
	
	Если НЕ ФайлДокумента.Существует() Тогда
		ВызватьИсключение НСТр("ru = 'Файл не найден:'") + ПараметрыЗагрузки.ПутьКДокументу
	КонецЕсли;
	
	// Получаем переменные
	//
	
	ПутьКФайлуДокумента    = ПараметрыЗагрузки.ПутьКДокументу;	
	ПутьККаталогуДокумента = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ФайлДокумента.Путь);
	
	Если ПараметрыЗагрузки.Свойство("ФайлыДляУдаления") Тогда
		ФайлыДляУдаления = ПараметрыЗагрузки.ФайлыДляУдаления;
	Иначе
		ФайлыДляУдаления = Новый Массив;
	КонецЕсли;
	
	WordApp = ПараметрыЗагрузки.Приложение;
	
	ПолучитьHTML = ?(ПараметрыЗагрузки.Свойство("ПолучитьHTML") И ПараметрыЗагрузки.ПолучитьHTML, Истина, Ложь);
	
	// Если ПолучитьHTML установлено в Истина, то процедура будет формировать только HTML документ,
	// без сохранения файла документа. Дальнейшая правка документа в базе будет невозможна. Используется
	// при загрузке документов из каталога для совместимости со старым режимом загрузки.
	
	ФайлыДляСохранения = Новый Массив(); // Файлы, которые реально будут сохранены в базе
	
	ДокументДляСохранения = Неопределено;
	
	Если НЕ ПолучитьHTML Тогда
		ДокументДляСохранения = ФайлДокумента;
	КонецЕсли;
	
	// Формируем HTML вариант документа
	//
	
	DocAsHTML = WordApp.Documents.Open(ПутьКФайлуДокумента,,,Ложь);
	
	DocAsHTML.WebOptions.AllowPNG = Истина;
	DocAsHTML.WebOptions.Encoding = 65001;
	DocAsHTML.WebOptions.BrowserLevel = 2;
	DocAsHTML.WebOptions.OptimizeForBrowser = Истина;
	DocAsHTML.WebOptions.RelyOnCSS = Истина;
	
	Если ПолучитьHTML Тогда
		ФайлHTML = Новый Файл(ПутьККаталогуДокумента + "page.htm");		
	Иначе
		ФайлHTML = Новый Файл(РазработкаСУЗКлиентСервер.ПутьКФайлуЗапускаДокумента(ПутьККаталогуДокумента));		
	КонецЕсли;
		
	ФайлыДляУдаления.Добавить(ФайлHTML.ПолноеИмя);
	
	DocAsHTML.SaveAs(ФайлHTML.ПолноеИмя, 10,,,Ложь,,,,,,,65001); //wdFormatFilteredHTML, UTF-8
	
	Если ПолучитьHTML Тогда		
		ФайлыДляСохранения.Добавить(ФайлHTML);
	КонецЕсли;	
		
	ФайлHTMLДополнения = Новый Файл(ПутьККаталогуДокумента + ФайлHTML.ИмяБезРасширения + ".files");
	
	Если ФайлHTMLДополнения.Существует() Тогда		
		ФайлыДляУдаления.Добавить(ФайлHTMLДополнения.ПолноеИмя);
	Иначе
		ФайлHTMLДополнения = Новый Файл(ПутьККаталогуДокумента + ФайлHTML.ИмяБезРасширения + "_files");	
		Если ФайлHTMLДополнения.Существует() Тогда		
			ФайлыДляУдаления.Добавить(ФайлHTMLДополнения.ПолноеИмя);
		КонецЕсли;
	КонецЕсли;	
	
	// Обрабатываем гиперссылки
	//
	
	Если ПараметрыЗагрузки <> Неопределено 
		И ПараметрыЗагрузки.Свойство("СпособОткрытияСсылок") 
		И ПараметрыЗагрузки.Свойство("ЗависимыеРесурсы") 
		И ПараметрыЗагрузки.Свойство("ЗависимыеРесурсыДополняющиеAPI") 
		И ПараметрыЗагрузки.Свойство("ФайлыДляЗагрузки") 
		И ПараметрыЗагрузки.Свойство("ФайлДляЗагрузки") 
		И ПараметрыЗагрузки.ФайлДляЗагрузки.СоздаватьСсылки 
		И DocAsHTML.Hyperlinks.count > 0 Тогда
		
		// Выполняется загрузка документа с диска
		
		// Делаем копию документа и в ней заменяем ссылки (потом будем сохранять копию этого документа в базу)
		// Это необходимо, чтобы ссылки в документе имели специальный вид и подлежали дальнейшему редактированию.
		
		Если НЕ ПолучитьHTML Тогда
			
			ФайлКопииДокумента = Новый Файл(ПолучитьИмяВременногоФайла(ФайлДокумента.Расширение));
			
			ДокументДляСохранения = ФайлКопииДокумента; // Изменяем документ для сохранения на копию
			
			КопироватьФайл(ФайлДокумента.ПолноеИмя, ФайлКопииДокумента.ПолноеИмя);
				
			Doc_Copy = WordApp.Documents.Open(ФайлКопииДокумента.ПолноеИмя,,,Ложь);
			
			Для каждого Гиперссылка Из Doc_Copy.Hyperlinks Цикл
				
				ФайлГиперссылки = Новый Файл(ПутьККаталогуДокумента + Гиперссылка.Address);
				
				Если ФайлГиперссылки.Существует() Тогда
					
					НайденнаяСтрокаФайлаВДереве = НайтиФайлВДеревеПоПолномуИмени(ФайлГиперссылки.ПолноеИмя, ПараметрыЗагрузки.ФайлыДляЗагрузки);
					
					Если ЭтоГиперссылкаНаПлеер(Гиперссылка.TextToDisplay)
						И НайденнаяСтрокаФайлаВДереве <> Неопределено
						И ЗначениеЗаполнено(НайденнаяСтрокаФайлаВДереве.Ресурс) Тогда
						
						ВнутренняяГиперссылка = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(НайденнаяСтрокаФайлаВДереве.Ресурс);
						
						// Указываем гиперссылку на ресурс плеера, а не на подборку
						
					Иначе
						
						ВнутренняяГиперссылка = ПолучитьСсылкуНаФайлВСписке(ФайлГиперссылки.ПолноеИмя, ПараметрыЗагрузки.ЗависимыеРесурсы, ПараметрыЗагрузки.ФайлыДляЗагрузки, ПараметрыЗагрузки.СпособОткрытияСсылок);
						
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ВнутренняяГиперссылка) Тогда
						Гиперссылка.Address = ПрефиксКГиперссылкеДокумента() + ВнутренняяГиперссылка;	
					КонецЕсли;						
					
				КонецЕсли;
						
			КонецЦикла;
			
			Doc_Copy.Save();			
			
			Doc_Copy.Close();
			
			ФайлыДляУдаления.Добавить(ФайлКопииДокумента.ПолноеИмя);
			
		КонецЕсли;
			
		// Заменяем гиперссылки в HTML
		
		Для каждого Гиперссылка Из DocAsHTML.Hyperlinks Цикл
			
			ВнутренняяГиперссылка = "";
			
			ФайлГиперссылки = Новый Файл(Гиперссылка.Address);
			
			Если НЕ ФайлГиперссылки.Существует() ИЛИ НЕ ЗначениеЗаполнено(ФайлГиперссылки.Путь) Тогда
				ФайлГиперссылки = Новый Файл(ПутьККаталогуДокумента + Гиперссылка.Address);
			КонецЕсли;

			Если ФайлГиперссылки.Существует() Тогда
				
				// Получаем ссылку на файл
				
				ВнутренняяГиперссылка = ПолучитьСсылкуНаФайлВСписке(ФайлГиперссылки.ПолноеИмя, ПараметрыЗагрузки.ЗависимыеРесурсы, ПараметрыЗагрузки.ФайлыДляЗагрузки, ПараметрыЗагрузки.СпособОткрытияСсылок);
				
			Иначе
			
				// Ищем объект в базе
				
				СтруктураСсылки = ОбъектыСУЗКлиентСервер.СтруктураСтрокиПараметров(Гиперссылка.Address);
				
				СсылкаНаОбъектСУЗ = ОбъектыСУЗ.ПолучитьСсылкуПоИдентификатору(
					ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "object"), 
					ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "id")
				);
				
				Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(СсылкаНаОбъектСУЗ) Тогда
					ВнутренняяГиперссылка = ОбъектыСУЗКлиентСервер.ПолучитьАдресСсылкиИзСтруктуры(СтруктураСсылки);
				КонецЕсли;
				
			КонецЕсли;
			
			// Формируем ссылку в файле
			
			Если ЗначениеЗаполнено(ВнутренняяГиперссылка) Тогда
				
				// Изменяем гиперссылку
				
				Гиперссылка.Address = ПрефиксКГиперссылкеДокумента() + ВнутренняяГиперссылка;
				
				// Запоминаем видеоролик в виде ссылки "{{Текст ссылки}}"
				
				Если ФайлГиперссылки.Существует() И ЭтоГиперссылкаНаПлеер(Гиперссылка.TextToDisplay) Тогда
					
					НайденнаяСтрокаФайлаВДереве = НайтиФайлВДеревеПоПолномуИмени(ФайлГиперссылки.ПолноеИмя, ПараметрыЗагрузки.ФайлыДляЗагрузки);
					
					Если НайденнаяСтрокаФайлаВДереве <> Неопределено
						И ЗначениеЗаполнено(НайденнаяСтрокаФайлаВДереве.Ресурс) Тогда
						
						ИдентификаторРесурса = Строка(НайденнаяСтрокаФайлаВДереве.Ресурс.УникальныйИдентификатор());							
						
						Гиперссылка.TextToDisplay = "{{"+ИдентификаторРесурса+"}}";
						Гиперссылка.Address = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(НайденнаяСтрокаФайлаВДереве.Ресурс);
						
						// Запоминаем ресурсы, которые связаны с загружаемым документом
						
						Если ПараметрыЗагрузки.ЗависимыеРесурсыДополняющиеAPI.Найти(ИдентификаторРесурса) = Неопределено Тогда
							ПараметрыЗагрузки.ЗависимыеРесурсыДополняющиеAPI.Добавить(ИдентификаторРесурса);
						КонецЕсли;
						
						Если ПараметрыЗагрузки.ЗависимыеРесурсы.Найти(НайденнаяСтрокаФайлаВДереве.Ресурс) = Неопределено Тогда
							ПараметрыЗагрузки.ЗависимыеРесурсы.Добавить(НайденнаяСтрокаФайлаВДереве.Ресурс);
						КонецЕсли;										
						
					КонецЕсли;					
					
				КонецЕсли;
				
			Иначе
				
				Гиперссылка.Target = "_blank"; // Внешняя ссылка
				
			КонецЕсли;
			
			
		КонецЦикла;		
		
		
	Иначе
		
		// Выполняется редактирование документа, открытого из формы в программе
		
		Для каждого Гиперссылка Из DocAsHTML.Hyperlinks Цикл
			
			СтруктураСсылки = ОбъектыСУЗКлиентСервер.СтруктураСтрокиПараметров(Гиперссылка.Address);
			
			ИдентификаторОбъекта = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "id");
			ИмяОбъекта           = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "object");
			
			Если ЗначениеЗаполнено(ИмяОбъекта) И ЗначениеЗаполнено(ИдентификаторОбъекта) Тогда
				
				СсылкаНаОбъектСУЗ = ОбъектыСУЗ.ПолучитьСсылкуПоИдентификатору(ИмяОбъекта, ИдентификаторОбъекта);
				
				Если ЭтоГиперссылкаНаПлеер(Гиперссылка.TextToDisplay)
					И ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(СсылкаНаОбъектСУЗ) Тогда					
					
					ИдентификаторОбъектаСУЗ = Строка(СсылкаНаОбъектСУЗ.УникальныйИдентификатор());
					
					Гиперссылка.TextToDisplay = "{{"+ИдентификаторОбъекта+"}}";
					
					// В качестве текста гиперссылки ставим идентификатор объекта,
					// чтобы потом ее распознать, как плеер. Это же делается выше,
					// в случае загрузки документа из файла.
					
					// Запоминаем ресурсы, которые связаны с загружаемым документом
					
					Если ПараметрыЗагрузки.ЗависимыеРесурсыДополняющиеAPI.Найти(ИдентификаторОбъектаСУЗ) = Неопределено Тогда
						ПараметрыЗагрузки.ЗависимыеРесурсыДополняющиеAPI.Добавить(ИдентификаторОбъектаСУЗ);
					КонецЕсли;
					
					Если ПараметрыЗагрузки.ЗависимыеРесурсы.Найти(СсылкаНаОбъектСУЗ) = Неопределено Тогда
						ПараметрыЗагрузки.ЗависимыеРесурсы.Добавить(СсылкаНаОбъектСУЗ);
					КонецЕсли;										
					
					
				КонецЕсли;
				
			Иначе
				
				Гиперссылка.Target = "_blank"; // Внешняя ссылка
				
			КонецЕсли;

			
		КонецЦикла;
		
	КонецЕсли;	
	
	DocAsHTML.Save();	
	
	// Обрабатываем дополнительные файлы страницы (картинки в этих файлах)
	//
					
	Если ПараметрыЗагрузки <> Неопределено И ПараметрыЗагрузки.Свойство("НастройкиКартинок") И ФайлHTMLДополнения.Существует() Тогда
		
		ShellApp = Новый COMОбъект("shell.application");
		
		// Ищем все картинки в оригинальном каталоге.
		// Каждая картинка будет основой для серии картинок.
		// Серия картинок может содержать одну и более картинок.
		// Сейчас серия может содержать максимум две картинки - оригинальная и в формате PNG.
		
		СерииКартинокФайлы = НайтиФайлы(ФайлHTMLДополнения.ПолноеИмя, "image*.*", Ложь);		
		
		Для каждого ФайлКартинки Из СерииКартинокФайлы Цикл
			
			НоваяСерияКартинок = Новый Структура("Имя, Картинки", ФайлКартинки.ИмяБезРасширения, Новый Массив());
			
			ДобавитьКартинкуВСерию(НоваяСерияКартинок.Картинки, ФайлКартинки, ShellApp);
			
			ПараметрыЗагрузки.НастройкиКартинок.СерииКартинок.Добавить(НоваяСерияКартинок);
			
		КонецЦикла;
		
		// Ищем картинки PNG
		
		DocAsHTML_FULL = WordApp.Documents.Open(ПутьКФайлуДокумента,,,Ложь);
		
		DocAsHTML_FULL.WebOptions.AllowPNG = Истина;
		DocAsHTML_FULL.WebOptions.Encoding = 65001;
		DocAsHTML_FULL.WebOptions.BrowserLevel = 2;
		DocAsHTML_FULL.WebOptions.OptimizeForBrowser = Истина;
		DocAsHTML_FULL.WebOptions.RelyOnCSS = Истина;
		
		ФайлHTMLПолный = Новый Файл(ПутьККаталогуДокумента + ФайлHTML.ИмяБезРасширения + "_full.html");
		
		ФайлыДляУдаления.Добавить(ФайлHTMLПолный.ПолноеИмя);
		
		DocAsHTML_FULL.SaveAs(ФайлHTMLПолный.ПолноеИмя, 8,,,Ложь,,,,,,,65001); //wdFormatHTML, UTF-8
		
		DocAsHTML_FULL.Close();
				
		ФайлHTMLПолныйДополнения = Новый Файл(ПутьККаталогуДокумента + ФайлHTML.ИмяБезРасширения + "_full.files");
		
		Если НЕ ФайлHTMLПолныйДополнения.Существует() Тогда
			ФайлHTMLПолныйДополнения = Новый Файл(ПутьККаталогуДокумента + ФайлHTML.ИмяБезРасширения + "_full_files");			
		КонецЕсли;
		
		Если ФайлHTMLПолныйДополнения.Существует() Тогда
			
			ФайлыДляУдаления.Добавить(ФайлHTMLПолныйДополнения.ПолноеИмя);
			
			КартинкиСтандартные = НайтиФайлы(ФайлHTMLДополнения.ПолноеИмя, "image*.*", Ложь);
			КартинкиИсходные    = НайтиФайлы(ФайлHTMLПолныйДополнения.ПолноеИмя, "image*.*", Ложь);
			
			Если КартинкиСтандартные.Количество() = КартинкиИсходные.Количество() Тогда // Картинки не будут перепутаны
				
				// Копируем исходные картинки
				
				Для каждого СтандартныйФайл Из КартинкиСтандартные Цикл
					
					// Ищем исходный файл
					
					ИсходныйФайлСтандартного = Неопределено;
					
					Для каждого ИсходныйФайл Из КартинкиИсходные Цикл
						Если ИсходныйФайл.ИмяБезРасширения = СтандартныйФайл.ИмяБезРасширения Тогда
							ИсходныйФайлСтандартного = ИсходныйФайл;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					Если ИсходныйФайлСтандартного = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					НовыйДополнительныйФайл = Новый Файл(ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ФайлHTMLДополнения.ПолноеИмя) + ИсходныйФайлСтандартного.ИмяБезРасширения + "_src" + ИсходныйФайлСтандартного.Расширение);
						
					КопироватьФайл(ИсходныйФайлСтандартного.ПолноеИмя, НовыйДополнительныйФайл.ПолноеИмя);
						
					// Добавляем новую картинку PNG в серию
						
					ТекСерияКартинок = Неопределено;
					
					Для каждого Строка Из ПараметрыЗагрузки.НастройкиКартинок.СерииКартинок Цикл
					
						Если Строка.Имя = СтандартныйФайл.ИмяБезРасширения Тогда
							ТекСерияКартинок = Строка;
							Прервать;
						КонецЕсли;
					
					КонецЦикла;
					
					Если ТекСерияКартинок <> Неопределено Тогда
						ДобавитьКартинкуВСерию(ТекСерияКартинок.Картинки, НовыйДополнительныйФайл, ShellApp);	
					КонецЕсли;
				
				КонецЦикла;
				
			КонецЕсли;			
			
		КонецЕсли;		
						
	КонецЕсли; // Обработка доп. файлов
	
	// Закрываем документ
	//
	
	DocAsHTML.Close();	
	
	// Получаем данные для индексирования
	//
	
	Если ПараметрыЗагрузки.Свойство("ТекстовыеДанныеДляИндексирования") Тогда
		
		Извлечение = Новый ИзвлечениеТекста(ФайлHTML.ПолноеИмя);
		
		ТекстФайла = "";
		
		Попытка			
			ТекстФайла = Извлечение.ПолучитьТекст();			
		Исключение		
		КонецПопытки;
		
		ПараметрыЗагрузки.ТекстовыеДанныеДляИндексирования = ТекстФайла;
		
	КонецЕсли;	
	
	// Копируем получившийся HTML в один каталог
	//
	
	КаталогДляСохраненияHTML = ПолучитьИмяВременногоФайла("");	
	СоздатьКаталог(КаталогДляСохраненияHTML);	
	ФайлыДляУдаления.Добавить(КаталогДляСохраненияHTML);
	
	КаталогДляСохраненияHTML = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(КаталогДляСохраненияHTML);	

	КопироватьФайл(ФайлHTML.ПолноеИмя, КаталогДляСохраненияHTML + ФайлHTML.Имя);
	
	Если ФайлHTMLДополнения.Существует() Тогда
		
		КаталогДляСохраненияДопФайлов = КаталогДляСохраненияHTML + ФайлHTMLДополнения.Имя;
		
		СоздатьКаталог(КаталогДляСохраненияДопФайлов);
		
		КаталогДляСохраненияДопФайлов = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(КаталогДляСохраненияДопФайлов);
		
		ДопФайлы = НайтиФайлы(ФайлHTMLДополнения.ПолноеИмя, "*", Ложь);
		
		Для каждого ДопФайл Из ДопФайлы Цикл		
			КопироватьФайл(ДопФайл.ПолноеИмя, КаталогДляСохраненияДопФайлов + ДопФайл.Имя);				
		КонецЦикла;
		
	КонецЕсли;
	
	// Упаковываем HTML каталог
    //
	
	Если ПолучитьHTML Тогда		

		Если ФайлHTMLДополнения.Существует() Тогда
			
			ПутьККаталогуДляАрхивацииДопФайлов = КаталогДляСохраненияHTML + "tmp";
			
			СоздатьКаталог(ПутьККаталогуДляАрхивацииДопФайлов);
			
			ПутьКАрхивуZIP = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуДляАрхивацииДопФайлов)
			                 + ФайлHTMLДополнения.ИмяБезРасширения + ".files";
			
			ФайлZIP = Новый ЗаписьZipФайла(ПутьКАрхивуZIP);							
			ФайлZIP.Добавить(КаталогДляСохраненияДопФайлов + "*", РежимСохраненияПутейZIP.СохранятьОтносительныеПути,  РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
			ФайлZIP.Записать();		

			ФайлыДляУдаления.Добавить(ПутьКАрхивуZIP);			
			
			ФайлыДляСохранения.Добавить(Новый Файл(ПутьКАрхивуZIP));
			
		КонецЕсли;
		
	Иначе
		
		ПутьКАрхивуZIP = ПолучитьИмяВременногоФайла("zip");
		
		ФайлZIP = Новый ЗаписьZipФайла(ПутьКАрхивуZIP);							
		ФайлZIP.Добавить(КаталогДляСохраненияHTML + "*", РежимСохраненияПутейZIP.СохранятьОтносительныеПути,  РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
		ФайлZIP.Записать();		

		ФайлыДляУдаления.Добавить(ПутьКАрхивуZIP);		
		
		ФайлыДляСохранения.Добавить(Новый Файл(ПутьКАрхивуZIP));
		
	КонецЕсли;
	
	
	// Помещаем файл в хранилище на сервере	
	//
	
	Если ПолучитьHTML Тогда 
		
		ОбщегоНазначенияСУКлиентСервер.СформироватьОписаниеФайлов(ФайлыДляСохранения, ПараметрыЗагрузки.СтруктураФайлов, ПараметрыЗагрузки.ПередаваемыеФайлы, Ложь, ПараметрыЗагрузки.КонтекстФайла);			
		ПоместитьФайлы(ПараметрыЗагрузки.ПередаваемыеФайлы, ПараметрыЗагрузки.ПереданныеФайлы,, Ложь, ПараметрыЗагрузки.УникальныйИдентификатор);
		
	Иначе
		
		ФайлыДляСохранения.Добавить(ДокументДляСохранения);
		
		ПараметрыЗагрузки.СтруктураФайлов.Добавить(ОбщегоНазначенияСУКлиентСервер.НовоеОписаниеФайла(ФайлДокумента, ПараметрыЗагрузки.КонтекстФайла));
		
		Для каждого ФайлДляСохранения Из ФайлыДляСохранения Цикл		
			ПараметрыЗагрузки.ПередаваемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ФайлДляСохранения.ПолноеИмя));
		КонецЦикла;
		
		ПоместитьФайлы(ПараметрыЗагрузки.ПередаваемыеФайлы, ПараметрыЗагрузки.ПереданныеФайлы,, Ложь, ПараметрыЗагрузки.УникальныйИдентификатор);
		
	КонецЕсли;
		
	//Удаляем старые файлы
	//
	
	Для каждого ПутьКФайлу Из ФайлыДляУдаления Цикл
		УдалитьФайлы(ПутьКФайлу);
	КонецЦикла;	
	
	#КонецЕсли
	
КонецПроцедуры

Процедура СформироватьПрезентациюДляСохраненияВБазе(ПараметрыЗагрузки=Неопределено) Экспорт
	
	#Если НЕ ВебКлиент Тогда
		
	// Делаем проверки
	//
	
	Если ПараметрыЗагрузки = Неопределено
		ИЛИ	НЕ ПараметрыЗагрузки.Свойство("Приложение")
		ИЛИ НЕ ПараметрыЗагрузки.Свойство("УникальныйИдентификатор")
		ИЛИ НЕ ПараметрыЗагрузки.Свойство("ПутьКПрезентации") Тогда
		
		ВызватьИсключение НСтр("ru = 'Отсутствуют обязательные параметры загрузки документа'")
		
	КонецЕсли;
		
	ФайлПрезентации = Новый Файл(ПараметрыЗагрузки.ПутьКПрезентации);
	
	Если НЕ ФайлПрезентации.Существует() Тогда
		ВызватьИсключение НСТр("ru = 'Файл не найден:'") + ПараметрыЗагрузки.ПутьКПрезентации
	КонецЕсли;
	
	// Получаем переменные
	//
	
	ПутьКФайлуПрезентации  = ПараметрыЗагрузки.ПутьКПрезентации;	
	ПутьККаталогуПрезентации = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ФайлПрезентации.Путь);
	
	Если ПараметрыЗагрузки.Свойство("ФайлыДляУдаления") Тогда
		ФайлыДляУдаления = ПараметрыЗагрузки.ФайлыДляУдаления;
	Иначе
		ФайлыДляУдаления = Новый Массив;
	КонецЕсли;
	
	КаталогИмпорта = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПолучитьИмяВременногоФайла(""));
	
	СоздатьКаталог(КаталогИмпорта);	
	
	PPTApp = ПараметрыЗагрузки.Приложение;
	
	ФайлыДляСохранения = Новый Массив(); // Файлы, которые реально будут сохранены в базе
	
	// Формируем файлы слайдов
	//
	
	PPT = PPTApp.Presentations.Open(ПутьКФайлуПрезентации,,,Ложь);
	
	PPT.SaveAs(КаталогИмпорта + "pages", 18); //ppSaveAsPNG
	
	PPT.Close();
		
	// Ищем все файлы слайдов и сортируем их
	//
					
	
	ФайлыВКаталогеСлайдов = НайтиФайлы(КаталогИмпорта + "pages\", "*");
	
	МассивИменФайлов = Новый Массив;
	
	Для каждого Файл Из ФайлыВКаталогеСлайдов Цикл
		МассивИменФайлов.Добавить(Файл.ИмяБезРасширения);
	КонецЦикла;
	
	ОтсортированныеИменаФайлов = ОтсортироватьИменаФайловПрезентацииПоАлфавиту(МассивИменФайлов);
	
	Если ОтсортированныеИменаФайлов.Количество() > 9999 Тогда
		
		Текст = НСтр("ru = 'Количество файлов в презентации ""%1"" больше 9999. Загрузка не может быть выполнена'");
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, ФайлПрезентации.Имя);		
		
		ВызватьИсключение Текст
		
	КонецЕсли;
	
	НомерФайла = 1;
	
	Для каждого ИмяФайла Из ОтсортированныеИменаФайлов Цикл
	
		Для каждого Файл Из ФайлыВКаталогеСлайдов Цикл // Ищем файл-объект
		
			Если Файл.ИмяБезРасширения = ИмяФайла Тогда
				
				НовоеИмяФайла = "slide_";
				КоличествоЛидирующихНулей = 4 - СтрДлина(Строка(НомерФайла));
				
				Пока КоличествоЛидирующихНулей > 0 Цикл
				
					НовоеИмяФайла = НовоеИмяФайла + "0";
					
					КоличествоЛидирующихНулей = КоличествоЛидирующихНулей - 1;
					
				КонецЦикла;
				
				НовоеПолноеИмяФайла = Файл.Путь + НовоеИмяФайла + Строка(НомерФайла) + НРег(Файл.Расширение);
				
				ПереместитьФайл(Файл.ПолноеИмя, НовоеПолноеИмяФайла);
				
				ФайлыДляСохранения.Добавить(Новый Файл(НовоеПолноеИмяФайла));
				
				Прервать;
				
			КонецЕсли;
		
		КонецЦикла;
				
		НомерФайла = НомерФайла + 1;
		
	КонецЦикла;
	
	ФайлыДляУдаления.Добавить(КаталогИмпорта);
	
	// Помещаем файлы на сервер
	//
	
	ФайлыДляСохранения.Добавить(ФайлПрезентации);
	
	ПараметрыЗагрузки.СтруктураФайлов.Добавить(ОбщегоНазначенияСУКлиентСервер.НовоеОписаниеФайла(ФайлПрезентации, ПараметрыЗагрузки.КонтекстФайла));
	
	Для каждого ФайлДляСохранения Из ФайлыДляСохранения Цикл		
		ПараметрыЗагрузки.ПередаваемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ФайлДляСохранения.ПолноеИмя));
	КонецЦикла;
	
	ПоместитьФайлы(ПараметрыЗагрузки.ПередаваемыеФайлы, ПараметрыЗагрузки.ПереданныеФайлы,, Ложь, ПараметрыЗагрузки.УникальныйИдентификатор);
	
	//Удаляем старые файлы
	//
	
	Для каждого ПутьКФайлу Из ФайлыДляУдаления Цикл
		
		Попытка
			УдалитьФайлы(ПутьКФайлу);
		Исключение
		КонецПопытки;
		
	КонецЦикла;	
	
	#КонецЕсли
	
	
КонецПроцедуры

Функция НайтиФайлВДеревеПоПолномуИмени(ПолныйПутьКФайлу, ФайлыДляЗагрузки, СтрокаДерева=Неопределено) Экспорт
	
	Если СтрокаДерева = Неопределено Тогда
		ЭлементыДляОбхода = ФайлыДляЗагрузки.ПолучитьЭлементы();
	Иначе
		ЭлементыДляОбхода = СтрокаДерева.ПолучитьЭлементы();
	КонецЕсли;
	
	НайденнаяСтрока = Неопределено;
	
	Для каждого ФайлДляЗагрузки Из ЭлементыДляОбхода Цикл
		
		Если ФайлДляЗагрузки.Путь = ПолныйПутьКФайлу Тогда
			
			НайденнаяСтрока = ФайлДляЗагрузки;
			
			Прервать;
			
		КонецЕсли;
		
		Если ФайлДляЗагрузки.ЭтоКаталог Тогда
			
			НайденнаяСтрока = НайтиФайлВДеревеПоПолномуИмени(ПолныйПутьКФайлу, ФайлДляЗагрузки); // Рекурсия
			
			Если НайденнаяСтрока <> Неопределено Тогда
				Прервать;
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат	НайденнаяСтрока;
	
КонецФункции

Функция ПолучитьСсылкуНаФайлВСписке(ПолныйПутьКФайлу, ЗависимыеРесурсы, ФайлыДляЗагрузки, СпособОткрытияСсылок) Экспорт
	
	НайденнаяСтрока = НайтиФайлВДеревеПоПолномуИмени(ПолныйПутьКФайлу, ФайлыДляЗагрузки);
	
	Если НайденнаяСтрока = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Если СпособОткрытияСсылок = "new" Тогда
		
		ЦелевоеОкно = "new";
		
	ИначеЕсли СпособОткрытияСсылок = "this" Тогда
		
		ЦелевоеОкно = "this";
		
	Иначе		
	
		ЦелевоеОкно = "this";
		
		Если НайденнаяСтрока.Скрыть Тогда
			ЦелевоеОкно = "new";
		КонецЕсли;
		
	КонецЕсли;
		
	Если НайденнаяСтрока.Скрыть И ЗначениеЗаполнено(НайденнаяСтрока.Ресурс) Тогда
		
		Если ЗависимыеРесурсы.Найти(НайденнаяСтрока.Ресурс) = Неопределено Тогда
			ЗависимыеРесурсы.Добавить(НайденнаяСтрока.Ресурс);
		КонецЕсли;
		
		Возврат ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(НайденнаяСтрока.Ресурс, ЦелевоеОкно);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НайденнаяСтрока.ЭлементПодборки) Тогда
		Возврат ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(НайденнаяСтрока.ЭлементПодборки, ЦелевоеОкно,,Новый Структура("ПривязатьКИдентификаторуЭлементаПодборки", Истина));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НайденнаяСтрока.ЭлементСодержания) Тогда
		Возврат ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(НайденнаяСтрока.ЭлементСодержания, ЦелевоеОкно);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НайденнаяСтрока.Подборка) Тогда
		Возврат ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(НайденнаяСтрока.Подборка, ЦелевоеОкно);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НайденнаяСтрока.Ресурс) Тогда
		Возврат ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(НайденнаяСтрока.Ресурс, ЦелевоеОкно);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Процедура ДобавитьКартинкуВСерию(МассивКартинокСерии, ФайлКартинки, ShellApp)
	
	objFolder = ShellApp.NameSpace(ФайлКартинки.Путь);
	objItem   = objFolder.ParseName(ФайлКартинки.Имя) ;

	МассивКартинокСерии.Добавить(Новый Структура("Имя, РазмерКартинки, РазмерФайла", ФайлКартинки.Имя, objItem.ExtendedProperty("Dimensions"), ФайлКартинки.Размер()));
	
КонецПроцедуры

Функция НовоеОписаниеКартинокДокумента(ВариантЗагрузкиКартинок = Неопределено) Экспорт
	Возврат Новый Структура("ВариантЗагрузкиКартинок, СерииКартинок", ?(ВариантЗагрузкиКартинок = Неопределено, ПредопределенноеЗначение("Перечисление.ВариантыЗагрузкиКартинокФайловСУЗ.УвеличиватьСтандартные"),  ВариантЗагрузкиКартинок), Новый Массив()); // Информация о картинках, содержащихся в документе
КонецФункции

Функция ПрефиксКГиперссылкеДокумента() 
	
	Возврат "sdo1c";
	
КонецФункции

Функция ЭтоГиперссылкаНаПлеер(Знач ТекстГиперссылки) 
	
	ТекстГиперссылки = СокрЛП(ТекстГиперссылки);
	
	Возврат ?(Сред(ТекстГиперссылки, 1, 1) = "{"
		И Сред(ТекстГиперссылки, 2, 1) = "{"
		И Сред(ТекстГиперссылки, СтрДлина(ТекстГиперссылки) - 1, 1) = "}"
		И Сред(ТекстГиперссылки, СтрДлина(ТекстГиперссылки), 1) = "}", Истина, Ложь);	
	
КонецФункции

Функция ОтсортироватьИменаФайловПрезентацииПоАлфавиту(Знач МассивИменФайлов)
	
	СписокФайлов = Новый СписокЗначений;
	
	Для каждого ИмяФайла Из МассивИменФайлов Цикл
		
		// Алгоритм сортировки учитывает, что 1 стоит раньше 10,
		// а обычная сортировка по алфавиту это не учитывает.
		
		ДлинаИмениФайла = СтрДлина(ИмяФайла);
		НомерФайла = "";
		
		Для Номер = 1 По ДлинаИмениФайла Цикл
		
			ТекСимвол = Сред(ИмяФайла,Номер,1);
			
			Попытка
				СимволЧисло = Число(ТекСимвол);
			Исключение
				Продолжить;
			КонецПопытки;
			
			НомерФайла = НомерФайла + ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(СимволЧисло);
		
		КонецЦикла;
		
		Если ЗначениеЗаполнено(НомерФайла) Тогда
			НомерФайла = Число(НомерФайла);
		Иначе
			НомерФайла = 0;
		КонецЕсли;
		
		СписокФайлов.Добавить(НомерФайла, ИмяФайла);
		
	КонецЦикла;
	
	СписокФайлов.СортироватьПоЗначению();
	
	
	ОтсортированныеФайлы = Новый Массив();
	
	Для каждого Строка Из СписокФайлов Цикл	
		ОтсортированныеФайлы.Добавить(Строка.Представление);	
	КонецЦикла;
	
	Возврат ОтсортированныеФайлы;
	
КонецФункции


// Миниатюры

Функция ИнициализироватьРабочийКаталогРаботыСВидео() Экспорт
	
	#Если ВебКлиент Тогда
		
		Возврат Неопределено;
		
	#Иначе
		
		СистемнаяИнформация = Новый СистемнаяИнформация();
		
		ТипПлатформыНаКлиенте = СистемнаяИнформация.ТипПлатформы;
	
		Если ТипПлатформыНаКлиенте <> ТипПлатформы.Windows_x86 И ТипПлатформыНаКлиенте <> ТипПлатформы.Windows_x86_64 Тогда
			
			Возврат Неопределено;
			
		КонецЕсли;	
		
		РабочийКаталог = ПолучитьИмяВременногоФайла("");
		
		СоздатьКаталог(РабочийКаталог);
		
		РабочийКаталог = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(РабочийКаталог);
		
		ДвоичныеДанныеПрограммы   = РазработкаСУЗ.ДвоичныеДанныеПрограммы("КонвертерВидеоWindows");
		ПутьКПрограммеКонвертации = РабочийКаталог + "ffmpeg.exe";
		ДвоичныеДанныеПрограммы.Записать(ПутьКПрограммеКонвертации);		
		
		Возврат РабочийКаталог;
		
	#КонецЕсли	
	
КонецФункции

Функция ДвоичныеДанныеМиниатюрыВидео(ПутьКФайлуВидео, РабочийКаталог) Экспорт
	
	Попытка
		
		WshShell = Новый COMОбъект("WScript.Shell");
		WshShell.CurrentDirectory = РабочийКаталог;
		WshShell.Run(РабочийКаталог + "ffmpeg.exe -i """ + ПутьКФайлуВидео + """ -f image2 -vframes 1 -ss 00:00:02 thumbnail.jpg", 0, 1);
		
	Исключение
		
		ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(НСтр("ru = 'Конвертация видео'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), "Ошибка", "ДвоичныеДанныеМиниатюрыВидео(): " + ИнформацияОбОшибке() + Символы.ПС + ОписаниеОшибки());
		
		Возврат Неопределено;
		
	КонецПопытки;	
		
	ФайлМиниатюры = Новый Файл(РабочийКаталог + "thumbnail.jpg");
	
	Если НЕ ФайлМиниатюры.Существует() Тогда
		
		ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(НСтр("ru = 'Конвертация видео'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), "Ошибка", НСтр("ru = 'Не найден файл миниатюры'"));
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	ДвоичныеДанныеМиниатюры = Новый ДвоичныеДанные(ФайлМиниатюры.ПолноеИмя);
	
	Попытка
		УдалитьФайлы(ФайлМиниатюры.ПолноеИмя);
	Исключение
	КонецПопытки;	
	
	Возврат ДвоичныеДанныеМиниатюры;
	
КонецФункции

Функция РазмерВидео(ПутьКФайлуВидео, РабочийКаталог) Экспорт
	
	РазмерыПоУмолчанию = Новый Структура("Ширина, Высота", Неопределено, Неопределено);
	
	Попытка
		
		WshShell = Новый COMОбъект("WScript.Shell");
		WshShell.CurrentDirectory = РабочийКаталог;
		WshShell.Run(РабочийКаталог + "ffmpeg.exe -i """ + ПутьКФайлуВидео + """ -report", 0, 1);	
	
	Исключение
		
		ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(НСтр("ru = 'Конвертация видео'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), "Ошибка", "РазмерВидео(): " + ИнформацияОбОшибке() + Символы.ПС + ОписаниеОшибки());
		
		Возврат РазмерыПоУмолчанию;
		
	КонецПопытки;	
	
	НайденныеФайлы = НайтиФайлы(РабочийКаталог, "*.log", Ложь);
	
	Если НайденныеФайлы.Количество() = 0 Тогда
		
		ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(НСтр("ru = 'Конвертация видео'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), "Ошибка", НСтр("ru = 'Не найден файл для получения размера видео'"));
		
		Возврат РазмерыПоУмолчанию;
		
	КонецЕсли;
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	
	Попытка
		ТекстовыйДокумент.Прочитать(НайденныеФайлы[0].ПолноеИмя);
	Исключение
		Возврат РазмерыПоУмолчанию;
	КонецПопытки;	
	
	КоличествоСтрок = ТекстовыйДокумент.КоличествоСтрок();
	
	Для НомерСтроки = 1 По КоличествоСтрок Цикл
	
		Строка = ТекстовыйДокумент.ПолучитьСтроку(НомерСтроки);
		
		// Определяем, содержит ли строка данные о размере
		
		ПозицияStream = Найти(Строка, "Stream #");
		ПозицияVideo = Найти(Строка, "Video:");
		
		Если ПозицияStream = 0 ИЛИ ПозицияVideo = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаМассив = ОбщегоНазначенияСУКлиентСервер.РасщепитьСтроку(Строка, ",");
		
		Если СтрокаМассив.Количество() < 5 Тогда
			Продолжить;			
		КонецЕсли;
		
		ШиринаЧисло = Неопределено;
		ВысотаЧисло = Неопределено;
		
		Для каждого СтрокаРазмер Из СтрокаМассив Цикл
			
			СтрокаРазмер = СокрЛП(СтрокаРазмер);
			
			ПозицияПробела = Найти(СтрокаРазмер, " ");
			
			Если ПозицияПробела > 0 Тогда
				СтрокаРазмер = Сред(СтрокаРазмер, 1, ПозицияПробела-1); // Убираем информацию справа от пробела
			КонецЕсли;			
			
			РазмерМассив = ОбщегоНазначенияСУКлиентСервер.РасщепитьСтроку(СтрокаРазмер, "x");
			
			Если РазмерМассив.Количество() <> 2 Тогда
				Продолжить;
			КонецЕсли;
			
			Попытка
				ШиринаЧисло = Число(РазмерМассив[0]);
			Исключение				
			КонецПопытки;
			
			Попытка
				ВысотаЧисло = Число(РазмерМассив[1]);
			Исключение				
			КонецПопытки;			
			
			Если ТипЗнч(ШиринаЧисло) = Тип("Число")
				И ШиринаЧисло > 0
				И ТипЗнч(ВысотаЧисло) = Тип("Число")
				И ВысотаЧисло > 0 Тогда
				
				Прервать;
				
			Иначе
				
				ШиринаЧисло = Неопределено;
				ВысотаЧисло = Неопределено;				
				
			КонецЕсли;
		
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ШиринаЧисло)
			И ЗначениеЗаполнено(ВысотаЧисло) Тогда
			
			РазмерыПоУмолчанию.Ширина = ШиринаЧисло;
			РазмерыПоУмолчанию.Высота = ВысотаЧисло;
			
			Прервать;
			
		КонецЕсли;
			
	КонецЦикла;
	
	Попытка
		УдалитьФайлы(НайденныеФайлы[0].ПолноеИмя);
	Исключение
	КонецПопытки;	
	
	Если РазмерыПоУмолчанию.Ширина <> Неопределено И РазмерыПоУмолчанию.Высота <> Неопределено Тогда
		
		Пропорция = РазмерыПоУмолчанию.Высота / РазмерыПоУмолчанию.Ширина;
		
		РазмерыПоУмолчанию.Ширина = РазработкаСУЗПовтИсп.ШиринаВидеоПоУмолчанию();
		
		РазмерыПоУмолчанию.Высота = Окр(РазмерыПоУмолчанию.Ширина * Пропорция, 0);
		
		РазмерыПоУмолчанию.Ширина = ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(РазмерыПоУмолчанию.Ширина);
		РазмерыПоУмолчанию.Высота = ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(РазмерыПоУмолчанию.Высота);
		
	КонецЕсли;	
	
	Возврат РазмерыПоУмолчанию;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// УПРОЩЕННЫЙ ИНТЕРФЕЙС СУЗ

// Таблицы

Процедура РедактироватьЭлементТаблицыСУЗ(ТаблицаФормы, РеквизитЭлемента, ЭлектронныйРесурс=Неопределено, Подборка=Неопределено, Глоссарий=Неопределено) Экспорт
	
	ТекущиеДанные = ТаблицаФормы.ТекущиеДанные;
	
	Если НЕ ОбщегоНазначенияСУКлиент.ТекущиеДанныеТаблицыДоступны(ТекущиеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементДляРедактирования = ТекущиеДанные[РеквизитЭлемента];
	
	Если (ТекущиеДанные.Свойство("ЭтоГруппа") И ТекущиеДанные.ЭтоГруппа) ИЛИ НЕ ЗначениеЗаполнено(ЭлементДляРедактирования) Тогда
		ПоказатьЗначение(,ТекущиеДанные.Ссылка);
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	
	Если ТипЗнч(ЭлементДляРедактирования) = Тип("СправочникСсылка.РесурсыСУЗ") Тогда
		ПараметрыФормы.Вставить("ОткрытьФормуФайла", Истина);
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Ссылка) = Тип("СправочникСсылка.ЭлементыПодборкиСУЗ") Тогда
		ПараметрыФормы.Вставить("ЭлементПодборки", ТекущиеДанные.Ссылка);
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Ссылка) = Тип("СправочникСсылка.СодержаниеСУЗ") Тогда
		ПараметрыФормы.Вставить("ЭлементСодержания", ТекущиеДанные.Ссылка);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
		ПараметрыФормы.Вставить("ЭлектронныйРесурс", ЭлектронныйРесурс);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Подборка) Тогда
		ПараметрыФормы.Вставить("Подборка", Подборка);	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Глоссарий) Тогда
		ПараметрыФормы.Вставить("Глоссарий", Глоссарий);	
	КонецЕсли;	
	
	
	ОбщегоНазначенияСУКлиент.ОткрытьЗначениеВФорме(ЭлементДляРедактирования, ПараметрыФормы, ТаблицаФормы);
	
КонецПроцедуры

Процедура ДобавитьЭлементВТаблицуСУЗ(Форма, Таблица, ИмяСправочника, ПараметрыФормы=Неопределено) Экспорт
	
	Отказ = Ложь;
	
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(Форма, Отказ);
	
	Если НЕ Отказ Тогда
		ОткрытьФорму("Справочник."+ИмяСправочника+".ФормаВыбора", ПараметрыФормы, Таблица,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
	
КонецПроцедуры

Процедура СоздатьЭлементТаблицыСУЗ(Форма, Таблица, ИмяЭлемента, ЭлектронныйРесурс=Неопределено, Подборка=Неопределено, Глоссарий=Неопределено) Экспорт
	
	Отказ = Ложь;
	
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(Форма, Отказ);
	
	Если НЕ Отказ Тогда
		
		ПараметрыФормы = Новый Структура();
		
		ВыделеннаяГруппа = ОбщегоНазначенияСУКлиент.ВыделеннаяГруппаТаблицы(Таблица);
		
		Если ЗначениеЗаполнено(ВыделеннаяГруппа)
			И ТипЗнч(ВыделеннаяГруппа) = Тип("СправочникСсылка.СодержаниеСУЗ") Тогда
			
			ПараметрыФормы.Вставить("ГруппаЭлементаСодержания", ВыделеннаяГруппа);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
			ПараметрыФормы.Вставить("ЭлектронныйРесурс", ЭлектронныйРесурс);	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Подборка) Тогда
			ПараметрыФормы.Вставить("Подборка", Подборка);	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Глоссарий) Тогда
			ПараметрыФормы.Вставить("Глоссарий", Глоссарий);	
		КонецЕсли;		
		
		Если ИмяЭлемента = "Глоссарий" Тогда
			ИмяСправочника = "ГлоссарииСУЗ";				
		КонецЕсли;
		
		Если ИмяЭлемента = "Файл" Тогда
			
			ИмяСправочника = "РесурсыСУЗ";
			
			ПараметрыФормы.Вставить("ОткрытьФормуФайла", Истина);
			
		КонецЕсли;
		
		Если ИмяЭлемента = "Документ" Тогда
			
			ИмяСправочника = "РесурсыСУЗ";
			
			ПараметрыФормы.Вставить("ОткрытьФормуДокумента", Истина);
			
		КонецЕсли;
		
		Если ИмяЭлемента = "Тест" Тогда
			
			ИмяСправочника = "ПодборкиСУЗ";
			
			ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("ЭтоТест", Истина));
			
		КонецЕсли;
			
		Если ИмяЭлемента = "Теория" Тогда
			
			ИмяСправочника = "ПодборкиСУЗ";
			
			ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("ЭтоТест", Ложь));
			
		КонецЕсли;
		
		Если ИмяЭлемента = "Вопрос" Тогда
			
			ИмяСправочника = "ВопросыСУЗ";
			
		КонецЕсли;
		
		Если ИмяЭлемента = "Страница" Тогда
			
			ИмяСправочника = "СтраницыСУЗ";
			
		КонецЕсли;
		
		
		Если ИмяЭлемента = "Термин" Тогда
			
			ИмяСправочника = "ТерминыСУЗ";
			
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(ИмяСправочника) Тогда
		
			ОткрытьФорму("Справочник."+ИмяСправочника+".ФормаОбъекта", ПараметрыФормы, Таблица);
			
		Иначе
			
			ПоказатьПредупреждение(, НСтр("ru = 'Неизветный элемент'"));
			
		КонецЕсли;
		
		// Примечание: запись элемента будет перехвачена обработчиком СодержаниеОбработкаЗаписиНового.

	КонецЕсли;		
	
КонецПроцедуры

Процедура ЗагрузитьЭлементыВТаблицуСУЗ(Форма, Таблица, ЭлектронныйРесурс=Неопределено, Подборка=Неопределено, Ресурс=Неопределено, Глоссарий=Неопределено, ТипКонтента=Неопределено, СкрыватьЭлементы=Ложь) Экспорт
	
	Отказ = Ложь;
	
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(Форма, Отказ, Истина);
	
	Если НЕ Отказ Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьЭлементыВТаблицуСУЗПродолжение", ЭтотОбъект, Новый Структура("ТаблицаДляОбновления, Форма", Таблица, Форма));

		ВыделеннаяГруппа = ОбщегоНазначенияСУКлиент.ВыделеннаяГруппаТаблицы(Таблица);
		
		РазработкаСУЗКлиент.ЗагрузитьФайлы(ЭлектронныйРесурс, Подборка, Ресурс, Глоссарий, ВыделеннаяГруппа, ТипКонтента,, ОписаниеОповещения, СкрыватьЭлементы);
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ЗагрузитьЭлементыВТаблицуСУЗПродолжение(Результат, ДанныеФормы) Экспорт
	
	Если ДанныеФормы <> Неопределено Тогда
		
		Если ДанныеФормы.ТаблицаДляОбновления <> Неопределено Тогда
			ДанныеФормы.ТаблицаДляОбновления.Обновить();
		КонецЕсли;
		
		Если ДанныеФормы.Форма <> Неопределено Тогда
			ДанныеФормы.Форма.Прочитать();
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры

// Реквизиты

Процедура ОбработкаЗаписиНовогоЭлементаСУЗ(НовыйОбъект, Источник, Форма, СтандартнаяОбработка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(НовыйОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Источник.Параметры.Свойство("ИмяРеквизитаВладельца") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Источник.Параметры.ИмяРеквизитаВладельца) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Форма.Объект[Источник.Параметры.ИмяРеквизитаВладельца] = НовыйОбъект;
	
	Форма.Модифицированность = Истина;
	
	Форма.УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

Процедура ОбработкаВыбораНовогоЭлементаСУЗ(ВыбранныйОбъект, Источник, Форма) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВыбранныйОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Источник.Параметры.Свойство("ИмяРеквизитаВладельца") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Источник.Параметры.ИмяРеквизитаВладельца) Тогда
		Возврат;
	КонецЕсли;	
	
	Форма.Объект[Источник.Параметры.ИмяРеквизитаВладельца] = ВыбранныйОбъект;
	
	Форма.Модифицированность = Истина;
	
	Форма.УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

Процедура СоздатьЭлементРеквизитаСУЗ(Форма, ИмяРеквизита, ИмяСправочника, НаименованиеЭлемента="", ЭлектронныйРесурс=Неопределено, Подборка=Неопределено) Экспорт
	
	Отказ = Ложь;
	
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(Форма, Отказ);
	
	Если НЕ Отказ Тогда
	
		ОткрытьФорму("Справочник."+ИмяСправочника+".ФормаОбъекта", Новый Структура("ИмяРеквизитаВладельца, ЭлектронныйРесурс, Подборка, ЗначенияЗаполнения", ИмяРеквизита, ЭлектронныйРесурс, Подборка, Новый Структура("Наименование", НаименованиеЭлемента)), Форма);	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьЭлементРеквизитаСУЗ(Форма, ИмяРеквизита) Экспорт
	
	Форма.Объект[ИмяРеквизита] = Неопределено;
	
	Форма.Модифицированность = Истина;
	
	Форма.УстановитьДоступностьЭлементовФормы();	
	
КонецПроцедуры

Процедура УдалитьЭлементРеквизитаСУЗ(Форма, ИмяРеквизита, ТекстВопроса="") Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТекстВопроса) Тогда
		ТекстВопроса = НСтр("ru = 'Удалить элемент?'");
	КонецЕсли;
	
	ПараметрыПродолжения = Новый Структура("ИмяРеквизита, Форма", ИмяРеквизита, Форма);
	
	Оповещение = Новый ОписаниеОповещения("УдалитьЭлементРеквизитаСУЗПослеПодтверждения", ЭтотОбъект, ПараметрыПродолжения);
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0);
	
КонецПроцедуры

Процедура УдалитьЭлементРеквизитаСУЗПослеПодтверждения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	ИмяРеквизита = ДополнительныеПараметры.ИмяРеквизита;
	
	НоваяСтрока = Форма.ЭлементыДляУдаления.Добавить();	
	НоваяСтрока.Элемент = Форма.Объект[ИмяРеквизита];
	
	Форма.Объект[ИмяРеквизита] = Неопределено;
	
	Форма.Модифицированность = Истина;
	
	Форма.УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры	

Процедура РедактироватьЭлементРеквизитаСУЗ(Форма, ИмяРеквизита) Экспорт
	
	ПоказатьЗначение(,Форма.Объект[ИмяРеквизита]);
	
КонецПроцедуры

Процедура НайтиВСпискеЭлементРеквизитаСУЗ(Форма, ИмяРеквизита) Экспорт
	
	ИмяТаблица = ОбщегоНазначенияСУВызовСервера.ИмяТаблицыПоСсылке(Форма.Объект[ИмяРеквизита]);
	
	ОткрытьФорму(ИмяТаблица+".ФормаСписка", Новый Структура("ТекущаяСтрока", Форма.Объект[ИмяРеквизита]), Форма);
	
КонецПроцедуры

Процедура ДобавитьИзРанееСозданныхРеквизитСУЗ(Форма, ИмяРеквизита, ИмяСправочника) Экспорт
	
	ОткрытьФорму("Справочник."+ИмяСправочника+".ФормаВыбора", Новый Структура("ИмяРеквизитаВладельца", ИмяРеквизита), Форма);
	
КонецПроцедуры

// Устанавливает в форме электронный ресурс, в контексте которого открыта форма
//
Процедура УстановитьКонтекстЭлектронногоРесурса(Форма) Экспорт
	
	Если ТипЗнч(Форма) <> Тип("УправляемаяФорма") Тогда	
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Форма.ЭлектронныйРесурс) Тогда
		Возврат; // Уже есть контекст
	КонецЕсли;
	
	ФормаЭлектронногоРесурса = ОбщегоНазначенияСУКлиент.НайтиВладельцаУправляемойФормы(Форма.ВладелецФормы, "Справочник.СводыЗнанийСУЗ.Форма.ФормаЭлемента");
	
	Если ФормаЭлектронногоРесурса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма.ЭлектронныйРесурс = ФормаЭлектронногоРесурса.Объект.Ссылка;
	
КонецПроцедуры
